# Напишите программу, которая выводит:
# Сумму двух чисел.
# Разность двух чисел.
# Произведение двух чисел.
# Результат деления двух чисел.

a = 10
b = 50
print('Сумма a + b =', a + b)
print('Из a вычесть b =', a - b)
print('Итог умножения a * b =', a * b)
print('Итог деления a / b =', a / b)

