# **Обратный отсчёт**
# Напишите программу, которая использует цикл `while` для вывода чисел от 10 до 1,
# а затем выводит сообщение `"Счёт завершён!"`.

for i in range(10,0,-1):
    print(i)
print("Счёт завершён!")