# Вывод чисел от 1 до 10
# Напишите программу, которая использует цикл for, чтобы вывести числа от 1 до 10.

for i in range(11):
    print(i)