# **Таблица умножения на 5**

# Напишите программу, которая выводит таблицу умножения на 5 с использованием вложенного цикла.

for i in range(1,10):
    result = i * 5
    print(f'5 * {i} = {result}')
