# Написать функцию greet_user(name), которая принимает имя пользователя в качестве параметра
# и выводит приветствие вида "Привет, [имя]!"
# вызвать эту функцию несколько раз в коде с разными именами и сверить результат


def greet_user(name):
    print(f'Hello {name}!')

greet_user('Ivan')