# Написать функцию sum_numbers(a, b),
# которая принимает два числа в качестве параметров и выводит на экран их сумму


def sum_numbers(a, b):
    print(f'Сумма {a} и {b} равна:', a + b)


sum_numbers(2, 5)