# Написать функцию greet(),
# которая не принимает никаких параметров и выводит на экран сообщение "Hello, world!"

def greet():
    print("Hello, world!")

greet()
