#Напишите программу, которая:
# 1. Создаёт число `pi = 3.14159`.
# 2. Округляет его до двух знаков после запятой.
# 3. Выводит результат.

pi = 3.14159
print(round(pi, 2))