# Напишите программу, которая:
# Создаёт строку `text = "Hello, Python!"`.
# Выводит первые 5 символов строки.
# Выводит все символы строки через один.

text = "Hello, Python!"
print(text[0:5])
print(text[0::2])