# Напишите программу, которая:
# Создаёт строку `text = "Python is awesome!"`.
# Применяет к этой строке метод `upper()` и выводит результат.
# Применяет метод `replace()` для замены слова `awesome` на `amazing` и выводит результат.


text = 'text = "Python is awesome!"'
print(text.upper())
print(text.replace('awesome', 'amazing'))