# Напишите программу, которая:
# Создаёт переменные `name = "Alice"` и `age = 25`.
# Формирует строку вида: `Alice is 25 years old.` с помощью f-строки и выводит её.

name = 'Alice'
age = 25

print(f'{name} is {age} years old.')