# Задачи без return:

print('# 1. Создать функцию `greet(name)`, которая выводит приветствие с именем')
def greet(name):
    print(f'Hello {name}!')

greet('Alexey')
print('-------------------------------------------------------------------------------------------')

print('# 2. Создать функцию `print_number(num)`, которая выводит переданное число')
def print_number(num):
    print(f'переданное число = {num}')

print_number(25)
print('-------------------------------------------------------------------------------------------')

print('# 3. Создать функцию `repeat_word(word)`, которая выводит слово 3 раза')
def repeat_word(word):
    print(3 * (word + ' '))

repeat_word('Python')
print('-------------------------------------------------------------------------------------------')

print('# 4. Создать функцию `print_length(text)`, которая выводит длину переданного текста')
def print_length(text):
    print(f'длина переданного текста = {len(text)}')

print_length('Hello Python!')
print('-------------------------------------------------------------------------------------------')

print('# 5. Создать функцию `print_double(number)`, которая выводит число, умноженное на 2')
def print_double(number):
    print(f'число {number} умноженное на 2 = {number * 2}')

print_double(25)
print('-------------------------------------------------------------------------------------------')

print('# 6. Создать функцию `add_ten(number)`, которая печатает число плюс 10')
def add_ten(number):
    print(f'{number} + 10 = {number + 10}')

add_ten(12)
print('-------------------------------------------------------------------------------------------')

print('# 7. Создать функцию `multiply_by_three(num)`, которая печатает число, умноженное на 3')
def multiply_by_three(num):
    print(f'{num} * 3 = {num * 3}')

multiply_by_three(15)
print('-------------------------------------------------------------------------------------------')

print('# 8. Создать функцию `is_even(number)`, которая печатает True, если число четное, и False если нечетное.\n     Напечатать отдельно результат работы этой функции')
def is_even(number):
    if number % 2 == 0:
        return True
    else:
        return False
print(f'Is even? {is_even(25)}')