print('-------------------------------------------------------------------------------------------')
print('# 1. Создать функцию `print_range(n)`, которая выводит числа от 1 до n')
def print_range(n):
    for i in range(1, n):
        print(i)
print_range(4)
print('-------------------------------------------------------------------------------------------')

print('# 2. Создать функцию `print_stars(count)`, которая выводит указанное количество звездочек в ряд')
def print_stars(count):
    print('*' * count)

print_stars(12)
print('-------------------------------------------------------------------------------------------')

print('# 3. Создать функцию `print_table(num)`, которая выводит таблицу умножения для числа num (от 1 до 5)')
def print_table(num):
    for i in range(1, 6):
        print(i * num)

print_table(2)
print('-------------------------------------------------------------------------------------------')

print('# 4. Создать функцию analyze_number(num), которая выводит информацию о переданном числе:\n это положительное число, отрицательное или ноль')
def analyze_number(num):
    if num > 0:
        print(f'Число {num} положительное')
    elif num < 0:
        print(f'Число {num} отрицательное')
    else:
        print('Это ноль')

analyze_number(-9)
print('-------------------------------------------------------------------------------------------')

print('# 5. Создать функцию `count_digits(number)`, которая возвращает количество цифр в числе')
def count_digits(number):
    print(len(str(number)))

count_digits(243)
print('-------------------------------------------------------------------------------------------')

print('# 6. Создать функцию `sum_to_n(n)`, которая возвращает сумму чисел от 1 до n')
def sum_to_n(n):
    print(sum(range(1, n)))

sum_to_n(12)
print('-------------------------------------------------------------------------------------------')

print('# 7. Создать функцию `get_grade(score)`, которая возвращает оценку: 90+ = "A", 80+ = "B", 70+ = "C", иначе "F"')
def get_grade(score):
    if score > 90:
        print('A')
    elif 80 < score <= 90:
        print('B')
    elif 70 < score <=80:
        print('C')
    else:
        print('F')

get_grade(7)