# Создайте кортеж `numbers = (10, 20, 30, 40, 50)`.
# Выведите второй элемент кортежа.
# Попробуйте изменить значение третьего элемента и объясните результат.

numbers = (10, 20, 30, 40, 50)
print(numbers[1])

numbers[2] = 35
print(numbers)  

