# Создайте список `fruits = ["apple", "banana", "cherry", "date"]`.
# Добавьте в список новый фрукт `"kiwi"`.
# Удалите фрукт `"banana"`.
# Выведите итоговый список.

fruits = ['apple', 'banana', 'cherry', 'date']

fruits.append('kiwi')
fruits.remove('banana')

print(fruits)