# Создайте словарь `person = {"name": "Alice", "age": 25, "city": "New York"}`.
# Обновите возраст на `26`.
# Добавьте новый ключ `"profession"` со значением `"engineer"`.
# Выведите обновлённый словарь.

person = {"name": "Alice", "age": 25, "city": "New York"}
person["age"] = 30
person["profession"] = "engineer"

print(person)
