# Дан список nums = [3, 4, 11, 4, 4].
# Надо заменить третий элемент на 100 и вывести обновленный список

start_list = [3, 4, 11, 4, 4]
start_list[2] = 100

print(start_list)