# Cоздать список с 5 числами (например 1, 2, 3, 4, 5)
# Вывести в терминал сумму этих чисел

list_a = range(1,10,2)
main_list = list(list_a)

print(sum(main_list))