# Сделать пустой список
# Пополнить список из диапазона чисел от 1 до 100 с шагом в 3
# Вывести этот список на экран

main_list = list()
main_list.extend(range(1,101,3))

print(main_list)