# Дан словарь products = {"яблоко": 100, "банан": 50, "апельсин": 70}
# Вывести на экр сумму всех цен

products = {"яблоко": 100, "банан": 50, "апельсин": 70}

for i in products:
    print(f'Цена за {i} {products[i]} у.е.')