# Дан список `fruits = ["яблоко", "банан", "груша"]
# Нужно вывести каждый элемент этого списка на отдельной строке


fruits = ["яблоко", "банан", "груша"]

for i in fruits:
    print(i)